mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xr/common/mb9bf56xr.h
typedef struct stc_sdif_shctl2_field
{
    union {
        struct {
            __IO  uint16_t  UHSMDSEL             :3;
            __IO  uint16_t  V18SGNEN             :1;
            __IO  uint16_t  DRVSEL               :2;
            __IO  uint16_t  DOTUING              :1;
            __IO  uint16_t  SMPCLKSEL            :1;
            __IO  uint16_t  RESERVED1            :6;
            __IO  uint16_t  ASYINTEN             :1;
            __IO  uint16_t  PREVALEN             :1;
        };
        struct {
            __IO  uint16_t  UHSMDSEL0            :1;
            __IO  uint16_t  UHSMDSEL1            :1;
            __IO  uint16_t  UHSMDSEL2            :1;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  DRVSEL0              :1;
            __IO  uint16_t  DRVSEL1              :1;
            __IO  uint16_t  RESERVED2            :10;
        };
    };
} stc_sdif_shctl2_field_t;

typedef struct stc_sdif_capblty0_field
{
    union {
        struct {
            __IO  uint16_t  TOCLKFREQ            :6;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TOCLKUNIT            :1;
            __IO  uint16_t  SDBASECLK            :8;
        };
        struct {
            __IO  uint16_t  TOCLKFREQ0           :1;
            __IO  uint16_t  TOCLKFREQ1           :1;
            __IO  uint16_t  TOCLKFREQ2           :1;
            __IO  uint16_t  TOCLKFREQ3           :1;
            __IO  uint16_t  TOCLKFREQ4           :1;
            __IO  uint16_t  TOCLKFREQ5           :1;
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  SDBASECLK0           :1;
            __IO  uint16_t  SDBASECLK1           :1;
            __IO  uint16_t  SDBASECLK2           :1;
            __IO  uint16_t  SDBASECLK3           :1;
            __IO  uint16_t  SDBASECLK4           :1;
            __IO  uint16_t  SDBASECLK5           :1;
            __IO  uint16_t  SDBASECLK6           :1;
            __IO  uint16_t  SDBASECLK7           :1;
        };
    };
} stc_sdif_capblty0_field_t;

typedef struct stc_sdif_capblty1_field
{
    union {
        struct {
            __IO  uint16_t  MAXBLCKLEN           :2;
            __IO  uint16_t  EMBD8BIT             :1;
            __IO  uint16_t  ADMA2SPT             :1;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  HGHSPDSPT            :1;
            __IO  uint16_t  SDMASPT              :1;
            __IO  uint16_t  LWPWRSPT             :1;
            __IO  uint16_t  V33SPT               :1;
            __IO  uint16_t  V30SPT               :1;
            __IO  uint16_t  V18SPT               :1;
            __IO  uint16_t  RESERVED1            :1;
            __IO  uint16_t  BUS64SPT             :1;
            __IO  uint16_t  ASYINTSPT            :1;
            __IO  uint16_t  STOPTYPE             :2;
        };
        struct {
            __IO  uint16_t  MAXBLCKLEN0          :1;
            __IO  uint16_t  MAXBLCKLEN1          :1;
            __IO  uint16_t  RESERVED2            :12;
            __IO  uint16_t  STOPTYPE0            :1;
            __IO  uint16_t  STOPTYPE1            :1;
        };
    };
} stc_sdif_capblty1_field_t;

typedef struct stc_sdif_capblty2_field
{
    union {
        struct {
            __IO  uint16_t  SDR50SPT             :1;
            __IO  uint16_t  SDR104SPT            :1;
            __IO  uint16_t  DDR50SPT             :1;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  DRVTPASPT            :1;
            __IO  uint16_t  DRVTPCSPT            :1;
            __IO  uint16_t  DRVTPDSPT            :1;
            __IO  uint16_t  RESERVED1            :1;
            __IO  uint16_t  TMCNTRETN            :4;
            __IO  uint16_t  RESERVED3            :1;
            __IO  uint16_t  USETNSDR50           :1;
            __IO  uint16_t  RETNMODE             :2;
        };
        struct {
            __IO  uint16_t  RESERVED2            :8;
            __IO  uint16_t  TMCNTRETN0           :1;
            __IO  uint16_t  TMCNTRETN1           :1;
            __IO  uint16_t  TMCNTRETN2           :1;
            __IO  uint16_t  TMCNTRETN3           :1;
            __IO  uint16_t  RESERVED4            :2;
            __IO  uint16_t  RETNMODE0            :1;
            __IO  uint16_t  RETNMODE1            :1;
        };
    };
} stc_sdif_capblty2_field_t;

typedef struct stc_sdif_capblty3_field
{
    union {
        struct {
            __IO  uint16_t  CLKMULTPL            :8;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  CLKMULTPL0           :1;
            __IO  uint16_t  CLKMULTPL1           :1;
            __IO  uint16_t  CLKMULTPL2           :1;
            __IO  uint16_t  CLKMULTPL3           :1;
            __IO  uint16_t  CLKMULTPL4           :1;
            __IO  uint16_t  CLKMULTPL5           :1;
            __IO  uint16_t  CLKMULTPL6           :1;
            __IO  uint16_t  CLKMULTPL7           :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_sdif_capblty3_field_t;

typedef struct stc_sdif_mxccapy0_field
{
    union {
        struct {
            __IO  uint16_t  V33MAXCUR            :8;
            __IO  uint16_t  V30MAXCUR            :8;
        };
        struct {
            __IO  uint16_t  V33MAXCUR0           :1;
            __IO  uint16_t  V33MAXCUR1           :1;
            __IO  uint16_t  V33MAXCUR2           :1;
            __IO  uint16_t  V33MAXCUR3           :1;
            __IO  uint16_t  V33MAXCUR4           :1;
            __IO  uint16_t  V33MAXCUR5           :1;
            __IO  uint16_t  V33MAXCUR6           :1;
            __IO  uint16_t  V33MAXCUR7           :1;
            __IO  uint16_t  V30MAXCUR0           :1;
            __IO  uint16_t  V30MAXCUR1           :1;
            __IO  uint16_t  V30MAXCUR2           :1;
            __IO  uint16_t  V30MAXCUR3           :1;
            __IO  uint16_t  V30MAXCUR4           :1;
            __IO  uint16_t  V30MAXCUR5           :1;
            __IO  uint16_t  V30MAXCUR6           :1;
            __IO  uint16_t  V30MAXCUR7           :1;
        };
    };
} stc_sdif_mxccapy0_field_t;

