mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xr/common/mb9bf56xr.h
/*******************************************************************************
* BTIOSEL03 Registers BTIOSEL03
*   Register Definition
*******************************************************************************/
#define FM_BTIOSEL03_BTSEL0123                    *((volatile  uint8_t*)(0x40025101UL))
#define FM4_BTIOSEL03_BTSEL0123                   *((volatile  uint8_t*)(0x40025101UL))

/*******************************************************************************
* BTIOSEL47 Registers BTIOSEL47
*   Register Definition
*******************************************************************************/
#define FM_BTIOSEL47_BTSEL4567                    *((volatile  uint8_t*)(0x40025301UL))
#define FM4_BTIOSEL47_BTSEL4567                   *((volatile  uint8_t*)(0x40025301UL))

/*******************************************************************************
* CAN Registers CAN0
*   Register Definition
*******************************************************************************/
#define FM_CAN0_CTRLR                             *((volatile uint16_t*)(0x40062000UL))
#define FM4_CAN0_CTRLR                            *((volatile uint16_t*)(0x40062000UL))
#define FM_CAN0_STATR                             *((volatile uint16_t*)(0x40062002UL))
#define FM4_CAN0_STATR                            *((volatile uint16_t*)(0x40062002UL))
#define FM_CAN0_ERRCNT                            *((volatile uint16_t*)(0x40062004UL))
#define FM4_CAN0_ERRCNT                           *((volatile uint16_t*)(0x40062004UL))
#define FM_CAN0_BTR                               *((volatile uint16_t*)(0x40062006UL))
#define FM4_CAN0_BTR                              *((volatile uint16_t*)(0x40062006UL))
#define FM_CAN0_INTR                              *((volatile uint16_t*)(0x40062008UL))
#define FM4_CAN0_INTR                             *((volatile uint16_t*)(0x40062008UL))
#define FM_CAN0_TESTR                             *((volatile uint16_t*)(0x4006200AUL))
#define FM4_CAN0_TESTR                            *((volatile uint16_t*)(0x4006200AUL))
#define FM_CAN0_BRPER                             *((volatile uint16_t*)(0x4006200CUL))
#define FM4_CAN0_BRPER                            *((volatile uint16_t*)(0x4006200CUL))
#define FM_CAN0_IF1CREQ                           *((volatile uint16_t*)(0x40062010UL))
#define FM4_CAN0_IF1CREQ                          *((volatile uint16_t*)(0x40062010UL))
#define FM_CAN0_IF1CMSK                           *((volatile uint16_t*)(0x40062012UL))
#define FM4_CAN0_IF1CMSK                          *((volatile uint16_t*)(0x40062012UL))
#define FM_CAN0_IF1MSK                            *((volatile uint32_t*)(0x40062014UL))
#define FM4_CAN0_IF1MSK                           *((volatile uint32_t*)(0x40062014UL))
#define FM_CAN0_IF1ARB                            *((volatile uint32_t*)(0x40062018UL))
#define FM4_CAN0_IF1ARB                           *((volatile uint32_t*)(0x40062018UL))
#define FM_CAN0_IF1MCTR                           *((volatile uint16_t*)(0x4006201CUL))
#define FM4_CAN0_IF1MCTR                          *((volatile uint16_t*)(0x4006201CUL))
#define FM_CAN0_IF1DTA_L                          *((volatile uint32_t*)(0x40062020UL))
#define FM4_CAN0_IF1DTA_L                         *((volatile uint32_t*)(0x40062020UL))
#define FM_CAN0_IF1DTB_L                          *((volatile uint32_t*)(0x40062024UL))
#define FM4_CAN0_IF1DTB_L                         *((volatile uint32_t*)(0x40062024UL))
#define FM_CAN0_IF1DTA_B                          *((volatile uint32_t*)(0x40062030UL))
#define FM4_CAN0_IF1DTA_B                         *((volatile uint32_t*)(0x40062030UL))
#define FM_CAN0_IF1DTB_B                          *((volatile uint32_t*)(0x40062034UL))
#define FM4_CAN0_IF1DTB_B                         *((volatile uint32_t*)(0x40062034UL))
#define FM_CAN0_IF2CREQ                           *((volatile uint16_t*)(0x40062040UL))
#define FM4_CAN0_IF2CREQ                          *((volatile uint16_t*)(0x40062040UL))
#define FM_CAN0_IF2CMSK                           *((volatile uint16_t*)(0x40062042UL))
#define FM4_CAN0_IF2CMSK                          *((volatile uint16_t*)(0x40062042UL))
#define FM_CAN0_IF2MSK                            *((volatile uint32_t*)(0x40062044UL))
#define FM4_CAN0_IF2MSK                           *((volatile uint32_t*)(0x40062044UL))
#define FM_CAN0_IF2ARB                            *((volatile uint32_t*)(0x40062048UL))
#define FM4_CAN0_IF2ARB                           *((volatile uint32_t*)(0x40062048UL))
#define FM_CAN0_IF2MCTR                           *((volatile uint16_t*)(0x4006204CUL))
#define FM4_CAN0_IF2MCTR                          *((volatile uint16_t*)(0x4006204CUL))
#define FM_CAN0_IF2DTA_L                          *((volatile uint32_t*)(0x40062050UL))
#define FM4_CAN0_IF2DTA_L                         *((volatile uint32_t*)(0x40062050UL))
#define FM_CAN0_IF2DTB_L                          *((volatile uint32_t*)(0x40062054UL))
#define FM4_CAN0_IF2DTB_L                         *((volatile uint32_t*)(0x40062054UL))
#define FM_CAN0_IF2DTA_B                          *((volatile uint32_t*)(0x40062060UL))
#define FM4_CAN0_IF2DTA_B                         *((volatile uint32_t*)(0x40062060UL))
#define FM_CAN0_IF2DTB_B                          *((volatile uint32_t*)(0x40062064UL))
#define FM4_CAN0_IF2DTB_B                         *((volatile uint32_t*)(0x40062064UL))
#define FM_CAN0_TREQR                             *((volatile uint32_t*)(0x40062080UL))
#define FM4_CAN0_TREQR                            *((volatile uint32_t*)(0x40062080UL))
#define FM_CAN0_NEWDT                             *((volatile uint32_t*)(0x40062090UL))
#define FM4_CAN0_NEWDT                            *((volatile uint32_t*)(0x40062090UL))
#define FM_CAN0_INTPND                            *((volatile uint32_t*)(0x400620A0UL))
#define FM4_CAN0_INTPND                           *((volatile uint32_t*)(0x400620A0UL))
#define FM_CAN0_MSGVAL                            *((volatile uint32_t*)(0x400620B0UL))
#define FM4_CAN0_MSGVAL                           *((volatile uint32_t*)(0x400620B0UL))

