mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xr/common/mb9bf56xr.h
#define bFM_GPIO_DDR4_P0                          *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P0                         *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM_GPIO_DDR4_P1                          *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P1                         *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM_GPIO_DDR4_P2                          *((volatile  uint8_t *)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P2                         *((volatile  uint8_t *)(0x42DE4208UL))
#define bFM_GPIO_DDR4_P3                          *((volatile  uint8_t *)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P3                         *((volatile  uint8_t *)(0x42DE420CUL))
#define bFM_GPIO_DDR4_P4                          *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P4                         *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM_GPIO_DDR4_P5                          *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P5                         *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P8                         *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P9                         *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM_GPIO_DDR4_PB                          *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PB                         *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM_GPIO_DDR4_PC                          *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PC                         *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM_GPIO_DDR4_PD                          *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PD                         *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM_GPIO_DDR4_PE                          *((volatile  uint8_t *)(0x42DE4238UL))
#define bFM4_GPIO_DDR4_PE                         *((volatile  uint8_t *)(0x42DE4238UL))

#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P0                         *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P1                         *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P2                         *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P3                         *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P4                         *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P5                         *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P6                         *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM_GPIO_DDR5_P7                          *((volatile  uint8_t *)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P7                         *((volatile  uint8_t *)(0x42DE429CUL))
#define bFM_GPIO_DDR5_P8                          *((volatile  uint8_t *)(0x42DE42A0UL))
#define bFM4_GPIO_DDR5_P8                         *((volatile  uint8_t *)(0x42DE42A0UL))
#define bFM_GPIO_DDR5_P9                          *((volatile  uint8_t *)(0x42DE42A4UL))
#define bFM4_GPIO_DDR5_P9                         *((volatile  uint8_t *)(0x42DE42A4UL))
#define bFM_GPIO_DDR5_PA                          *((volatile  uint8_t *)(0x42DE42A8UL))
#define bFM4_GPIO_DDR5_PA                         *((volatile  uint8_t *)(0x42DE42A8UL))
#define bFM_GPIO_DDR5_PB                          *((volatile  uint8_t *)(0x42DE42ACUL))
#define bFM4_GPIO_DDR5_PB                         *((volatile  uint8_t *)(0x42DE42ACUL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P0                         *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P1                         *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P2                         *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P3                         *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM_GPIO_DDR6_P4                          *((volatile  uint8_t *)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P4                         *((volatile  uint8_t *)(0x42DE4310UL))
#define bFM_GPIO_DDR6_P5                          *((volatile  uint8_t *)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P5                         *((volatile  uint8_t *)(0x42DE4314UL))
#define bFM_GPIO_DDR6_P6                          *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P6                         *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM_GPIO_DDR6_P7                          *((volatile  uint8_t *)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P7                         *((volatile  uint8_t *)(0x42DE431CUL))
#define bFM_GPIO_DDR6_P8                          *((volatile  uint8_t *)(0x42DE4320UL))
#define bFM4_GPIO_DDR6_P8                         *((volatile  uint8_t *)(0x42DE4320UL))

#define bFM_GPIO_DDR7_P0                          *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P0                         *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM_GPIO_DDR7_P1                          *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P1                         *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM_GPIO_DDR7_P2                          *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P2                         *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM_GPIO_DDR7_P3                          *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P3                         *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM_GPIO_DDR7_P4                          *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM4_GPIO_DDR7_P4                         *((volatile  uint8_t *)(0x42DE4390UL))

#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P0                         *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM4_GPIO_DDR8_P1                         *((volatile  uint8_t *)(0x42DE4404UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P0                         *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P2                         *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x42DE470CUL))
#define bFM4_GPIO_DDRE_P3                         *((volatile  uint8_t *)(0x42DE470CUL))

