mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xr/common/mb9bf56xr.h
#define bFM_GPIO_PDOR4_P0                         *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P0                        *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM_GPIO_PDOR4_P1                         *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P1                        *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM_GPIO_PDOR4_P2                         *((volatile  uint8_t *)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P2                        *((volatile  uint8_t *)(0x42DE8208UL))
#define bFM_GPIO_PDOR4_P3                         *((volatile  uint8_t *)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P3                        *((volatile  uint8_t *)(0x42DE820CUL))
#define bFM_GPIO_PDOR4_P4                         *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P4                        *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM_GPIO_PDOR4_P5                         *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P5                        *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM_GPIO_PDOR4_PB                         *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PB                        *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM_GPIO_PDOR4_PC                         *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PC                        *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM_GPIO_PDOR4_PD                         *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PD                        *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM_GPIO_PDOR4_PE                         *((volatile  uint8_t *)(0x42DE8238UL))
#define bFM4_GPIO_PDOR4_PE                        *((volatile  uint8_t *)(0x42DE8238UL))

#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P0                        *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P1                        *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P2                        *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P3                        *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM_GPIO_PDOR5_P4                         *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P4                        *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM_GPIO_PDOR5_P5                         *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P5                        *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM_GPIO_PDOR5_P6                         *((volatile  uint8_t *)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P6                        *((volatile  uint8_t *)(0x42DE8298UL))
#define bFM_GPIO_PDOR5_P7                         *((volatile  uint8_t *)(0x42DE829CUL))
#define bFM4_GPIO_PDOR5_P7                        *((volatile  uint8_t *)(0x42DE829CUL))
#define bFM_GPIO_PDOR5_P8                         *((volatile  uint8_t *)(0x42DE82A0UL))
#define bFM4_GPIO_PDOR5_P8                        *((volatile  uint8_t *)(0x42DE82A0UL))
#define bFM_GPIO_PDOR5_P9                         *((volatile  uint8_t *)(0x42DE82A4UL))
#define bFM4_GPIO_PDOR5_P9                        *((volatile  uint8_t *)(0x42DE82A4UL))
#define bFM_GPIO_PDOR5_PA                         *((volatile  uint8_t *)(0x42DE82A8UL))
#define bFM4_GPIO_PDOR5_PA                        *((volatile  uint8_t *)(0x42DE82A8UL))
#define bFM_GPIO_PDOR5_PB                         *((volatile  uint8_t *)(0x42DE82ACUL))
#define bFM4_GPIO_PDOR5_PB                        *((volatile  uint8_t *)(0x42DE82ACUL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM_GPIO_PDOR6_P4                         *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P4                        *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM_GPIO_PDOR6_P5                         *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P5                        *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM_GPIO_PDOR6_P6                         *((volatile  uint8_t *)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P6                        *((volatile  uint8_t *)(0x42DE8318UL))
#define bFM_GPIO_PDOR6_P7                         *((volatile  uint8_t *)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P7                        *((volatile  uint8_t *)(0x42DE831CUL))
#define bFM_GPIO_PDOR6_P8                         *((volatile  uint8_t *)(0x42DE8320UL))
#define bFM4_GPIO_PDOR6_P8                        *((volatile  uint8_t *)(0x42DE8320UL))

